Extensions/src/Documents/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриемНаРаботу</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СчетЗатратРегл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Должность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Documents/ПриемНаРаботу/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаПриемНаРаботу, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ПриемНаРаботуСотрудники.НомерСтроки,
	|	ПриемНаРаботуСотрудники.Сотрудник,
	|	ПриемНаРаботуСотрудники.СтруктурнаяЕдиница,
	|	ПриемНаРаботуСотрудники.Должность,
	|	ПриемНаРаботуСотрудники.ГрафикРаботы,
	|	ПриемНаРаботуСотрудники.ЗанимаемыхСтавок,
	//Паганини_
	|	ПриемНаРаботуСотрудники.КлючСвязи,
	|	ПриемНаРаботуСотрудники.УчастникПенсионногоФонда,
	|	ПриемНаРаботуСотрудники.ВидУдержанияПФ,
	|	ПриемНаРаботуСотрудники.УчаствуетДобровольно,
	//_Паганини
	|	ПриемНаРаботуСотрудники.Период
	// +++ { AzRy - [23.12.2020] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ПриемНаРаботуСотрудники.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [23.12.2020] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ПОМЕСТИТЬ ТаблицаСотрудники
	|ИЗ
	|	Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботуСотрудники
	|ГДЕ
	|	ПриемНаРаботуСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ПриемНаРаботуСотрудники.НомерСтроки,
	|	ПриемНаРаботуСотрудники.Сотрудник,
	|	ПриемНаРаботуСотрудники.Период,
	|	ПриемНаРаботуНачисленияУдержания.ВидНачисленияУдержания,
	|	ПриемНаРаботуНачисленияУдержания.Валюта,
	|	ПриемНаРаботуНачисленияУдержания.Сумма,
	|	ПриемНаРаботуНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ПриемНаРаботуНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл
	|ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	|ИЗ
	|	Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботуСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.НачисленияУдержания КАК ПриемНаРаботуНачисленияУдержания
	|		ПО ПриемНаРаботуСотрудники.КлючСвязи = ПриемНаРаботуНачисленияУдержания.КлючСвязи
	|			И ПриемНаРаботуСотрудники.Ссылка = ПриемНаРаботуНачисленияУдержания.Ссылка
	|ГДЕ
	|	ПриемНаРаботуСотрудники.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ПриемНаРаботуСотрудники.НомерСтроки,
	|	ПриемНаРаботуСотрудники.Сотрудник,
	|	ПриемНаРаботуСотрудники.Период,
	|	ПриемНаРаботуНалогиНаДоходы.ВидНачисленияУдержания,
	|	ПриемНаРаботуНалогиНаДоходы.Валюта,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ПриемНаРаботу.Сотрудники КАК ПриемНаРаботуСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.НалогиНаДоходы КАК ПриемНаРаботуНалогиНаДоходы
	|		ПО ПриемНаРаботуСотрудники.КлючСвязи = ПриемНаРаботуНалогиНаДоходы.КлючСвязи
	|			И ПриемНаРаботуСотрудники.Ссылка = ПриемНаРаботуНалогиНаДоходы.Ссылка
	|ГДЕ
	|	ПриемНаРаботуСотрудники.Ссылка = &Ссылка
	|;
	|
	//Паганини_
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемНаРаботуНалогиНаДоходы.КлючСвязи,
	|	МАКСИМУМ(ПриемНаРаботуНалогиНаДоходы.ВидНачисленияУдержания) КАК ВидУдержанияНДФЛ
	|ПОМЕСТИТЬ ТаблицаСтавкиНДФЛ
	|ИЗ
	|	Документ.ПриемНаРаботу.НалогиНаДоходы КАК ПриемНаРаботуНалогиНаДоходы
	|ГДЕ
	|	ПриемНаРаботуНалогиНаДоходы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемНаРаботуНалогиНаДоходы.КлючСвязи
	|;
	//_Паганини
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.Организация,
	|	ТаблицаСотрудники.НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник,
	|	ТаблицаСотрудники.СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Должность,
	|	ТаблицаСотрудники.ГрафикРаботы,
	|	ТаблицаСотрудники.ЗанимаемыхСтавок,
	//Паганини_
	|	ЕСТЬNULL(ТаблицаСтавкиНДФЛ.ВидУдержанияНДФЛ, Значение(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) КАК ВидУдержанияНДФЛ,	
	|	ТаблицаСотрудники.УчастникПенсионногоФонда,
	|	ТаблицаСотрудники.ВидУдержанияПФ,
	|	ТаблицаСотрудники.УчаствуетДобровольно,
	//_Паганини
	|	ТаблицаСотрудники.Период
	// +++ { AzRy - [23.12.2020] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаСотрудники.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [23.12.2020] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтавкиНДФЛ КАК ТаблицаСтавкиНДФЛ
	|		ПО ТаблицаСотрудники.КлючСвязи = ТаблицаСтавкиНДФЛ.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачисленияУдержания.Организация,
	|	ТаблицаНачисленияУдержания.НомерСтроки,
	|	ТаблицаНачисленияУдержания.Сотрудник,
	|	ТаблицаНачисленияУдержания.Период,
	|	ТаблицаНачисленияУдержания.ВидНачисленияУдержания,
	|	ТаблицаНачисленияУдержания.Валюта,
	|	ТаблицаНачисленияУдержания.Сумма,
	|	ТаблицаНачисленияУдержания.СчетЗатрат,
	|	ТаблицаНачисленияУдержания.СчетЗатратРегл,
	|	ИСТИНА КАК Актуальность
	|ИЗ
	|	ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПриемНаРаботу);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаПриемНаРаботу.Дата),ДокументСсылкаПриемНаРаботу.Дата,ТекущаяДата())));

	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", 				МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлановыеНачисленияИУдержания", МассивРезультатов[4].Выгрузить());
	
	СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	
КонецПроцедуры
